src/cf/Documents/Questionnaire.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Questionnaire</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.QuestionnaireQuestionAnswers</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Survey</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PollPurpose</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Respondent</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Respondent</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EditDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SectionToEdit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuestionnaireTemplateQuestions</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Interviewer</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Interviewer</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QuestionnaireTemplate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuestionnaireTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SurveyMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SurveyModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Content</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DoQueryBox</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.QuestionnaireTemplateQuestions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ElementaryQuestion</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.QuestionsForSurvey</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CellNumber</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Response</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.QuestionsForSurvey</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OpenAnswer</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IsUnanswered</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/QuestionnaireQuestionAnswers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>QuestionnaireQuestionAnswers</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Response</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.QuestionsForSurvey</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>OpenAnswer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsUnanswered</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Questionnaire</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Questionnaire</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DoQueryBox</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuestionnaireTemplateQuestions</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ElementaryQuestion</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.QuestionsForSurvey</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CellNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/SurveyModes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>SurveyModes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Questionnaire</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Interview</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/Questionnaire/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	InfobaseUpdate.CheckObjectProcessed(ThisObject);
	
EndProcedure

Procedure Posting(Cancel, PostingMode)
	
	SetPrivilegedMode(True);
	
	RegisterRecords.QuestionnaireQuestionAnswers.Write = True;
	
	Query = New Query;
	Query.Text = "SELECT
	|	TableComposition.DoQueryBox,
	|	TableComposition.ElementaryQuestion,
	|	TableComposition.CellNumber,
	|	TableComposition.Response,
	|	TableComposition.OpenAnswer,
	|	TableComposition.LineNumber,
	|	TableComposition.IsUnanswered AS IsUnanswered
	|INTO Content
	|FROM
	|	&TableComposition AS TableComposition
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Content.DoQueryBox,
	|	Content.ElementaryQuestion,
	|	Content.CellNumber,
	|	CASE
	|		WHEN NOT Content.IsUnanswered
	|			THEN Content.Response
	|	END AS Response,
	|	Content.OpenAnswer,
	|	TRUE AS Active,
	|	&Ref AS Recorder,
	|	&Ref AS Questionnaire,
	|	Content.LineNumber AS LineNumber,
	|	Content.IsUnanswered AS IsUnanswered
	|FROM
	|	Content AS Content";
	
	Query.SetParameter("TableComposition",Content);
	Query.SetParameter("Ref",Ref);
	
	RegisterRecords.QuestionnaireQuestionAnswers.Load(Query.Execute().Unload());
	
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If FillingData <> Undefined Then
		FillPropertyValues(ThisObject,FillingData);
	EndIf;
	
	If SurveyMode = Enums.SurveyModes.Interview Then
		Interviewer = Users.CurrentUser();
	EndIf;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If SurveyMode = Enums.SurveyModes.Interview Then
		CheckedAttributes.Delete(CheckedAttributes.Find("Survey"));
	Else
		CheckedAttributes.Delete(CheckedAttributes.Find("QuestionnaireTemplate"));
	EndIf;
	
EndProcedure

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
